Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
extern volatile __CFD2FIFOSTA2bits_t CFD2FIFOSTA2bits __asm__ ("CFD2FIFOSTA2") __attribute__((section("sfrs"), address(0xBF8811B0)));
extern volatile uint32_t        CFD2FIFOSTA2CLR __attribute__((section("sfrs"),address(0xBF8811B4)));
extern volatile uint32_t        CFD2FIFOSTA2SET __attribute__((section("sfrs"),address(0xBF8811B8)));
extern volatile uint32_t        CFD2FIFOSTA2INV __attribute__((section("sfrs"),address(0xBF8811BC)));
#define CFD2FIFOUA2 CFD2FIFOUA2
extern volatile uint32_t   CFD2FIFOUA2 __attribute__((section("sfrs"), address(0xBF8811C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA2bits_t;
extern volatile __CFD2FIFOUA2bits_t CFD2FIFOUA2bits __asm__ ("CFD2FIFOUA2") __attribute__((section("sfrs"), address(0xBF8811C0)));
extern volatile uint32_t        CFD2FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8811C4)));
extern volatile uint32_t        CFD2FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8811C8)));
extern volatile uint32_t        CFD2FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8811CC)));
#define CFD2FIFOCON3 CFD2FIFOCON3
extern volatile uint32_t   CFD2FIFOCON3 __attribute__((section("sfrs"), address(0xBF8811D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON3bits_t;
extern volatile __CFD2FIFOCON3bits_t CFD2FIFOCON3bits __asm__ ("CFD2FIFOCON3") __attribute__((section("sfrs"), address(0xBF8811D0)));
extern volatile uint32_t        CFD2FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF8811D4)));
extern volatile uint32_t        CFD2FIFOCON3SET __attribute__((section("sfrs"),address(0xBF8811D8)));
extern volatile uint32_t        CFD2FIFOCON3INV __attribute__((section("sfrs"),address(0xBF8811DC)));
#define CFD2FIFOSTA3 CFD2FIFOSTA3
extern volatile uint32_t   CFD2FIFOSTA3 __attribute__((section("sfrs"), address(0xBF8811E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA3bits_t;
extern volatile __CFD2FIFOSTA3bits_t CFD2FIFOSTA3bits __asm__ ("CFD2FIFOSTA3") __attribute__((section("sfrs"), address(0xBF8811E0)));
extern volatile uint32_t        CFD2FIFOSTA3CLR __attribute__((section("sfrs"),address(0xBF8811E4)));
extern volatile uint32_t        CFD2FIFOSTA3SET __attribute__((section("sfrs"),address(0xBF8811E8)));
extern volatile uint32_t        CFD2FIFOSTA3INV __attribute__((section("sfrs"),address(0xBF8811EC)));
#define CFD2FIFOUA3 CFD2FIFOUA3
extern volatile uint32_t   CFD2FIFOUA3 __attribute__((section("sfrs"), address(0xBF8811F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA3bits_t;
extern volatile __CFD2FIFOUA3bits_t CFD2FIFOUA3bits __asm__ ("CFD2FIFOUA3") __attribute__((section("sfrs"), address(0xBF8811F0)));
extern volatile uint32_t        CFD2FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF8811F4)));
extern volatile uint32_t        CFD2FIFOUA3SET __attribute__((section("sfrs"),address(0xBF8811F8)));
extern volatile uint32_t        CFD2FIFOUA3INV __attribute__((section("sfrs"),address(0xBF8811FC)));
#define CFD2FIFOCON4 CFD2FIFOCON4
extern volatile uint32_t   CFD2FIFOCON4 __attribute__((section("sfrs"), address(0xBF881200)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON4bits_t;
extern volatile __CFD2FIFOCON4bits_t CFD2FIFOCON4bits __asm__ ("CFD2FIFOCON4") __attribute__((section("sfrs"), address(0xBF881200)));
extern volatile uint32_t        CFD2FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF881204)));
extern volatile uint32_t        CFD2FIFOCON4SET __attribute__((section("sfrs"),address(0xBF881208)));
extern volatile uint32_t        CFD2FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88120C)));
#define CFD2FIFOSTA4 CFD2FIFOSTA4
extern volatile uint32_t   CFD2FIFOSTA4 __attribute__((section("sfrs"), address(0xBF881210)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA4bits_t;
extern volatile __CFD2FIFOSTA4bits_t CFD2FIFOSTA4bits __asm__ ("CFD2FIFOSTA4") __attribute__((section("sfrs"), address(0xBF881210)));
extern volatile uint32_t        CFD2FIFOSTA4CLR __attribute__((section("sfrs"),address(0xBF881214)));
extern volatile uint32_t        CFD2FIFOSTA4SET __attribute__((section("sfrs"),address(0xBF881218)));
extern volatile uint32_t        CFD2FIFOSTA4INV __attribute__((section("sfrs"),address(0xBF88121C)));
#define CFD2FIFOUA4 CFD2FIFOUA4
extern volatile uint32_t   CFD2FIFOUA4 __attribute__((section("sfrs"), address(0xBF881220)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA4bits_t;
extern volatile __CFD2FIFOUA4bits_t CFD2FIFOUA4bits __asm__ ("CFD2FIFOUA4") __attribute__((section("sfrs"), address(0xBF881220)));
extern volatile uint32_t        CFD2FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF881224)));
extern volatile uint32_t        CFD2FIFOUA4SET __attribute__((section("sfrs"),address(0xBF881228)));
extern volatile uint32_t        CFD2FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88122C)));
#define CFD2FIFOCON5 CFD2FIFOCON5
extern volatile uint32_t   CFD2FIFOCON5 __attribute__((section("sfrs"), address(0xBF881230)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON5bits_t;
extern volatile __CFD2FIFOCON5bits_t CFD2FIFOCON5bits __asm__ ("CFD2FIFOCON5") __attribute__((section("sfrs"), address(0xBF881230)));
extern volatile uint32_t        CFD2FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF881234)));
extern volatile uint32_t        CFD2FIFOCON5SET __attribute__((section("sfrs"),address(0xBF881238)));
extern volatile uint32_t        CFD2FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88123C)));
#define CFD2FIFOSTA5 CFD2FIFOSTA5
extern volatile uint32_t   CFD2FIFOSTA5 __attribute__((section("sfrs"), address(0xBF881240)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA5bits_t;
extern volatile __CFD2FIFOSTA5bits_t CFD2FIFOSTA5bits __asm__ ("CFD2FIFOSTA5") __attribute__((section("sfrs"), address(0xBF881240)));
extern volatile uint32_t        CFD2FIFOSTA5CLR __attribute__((section("sfrs"),address(0xBF881244)));
extern volatile uint32_t        CFD2FIFOSTA5SET __attribute__((section("sfrs"),address(0xBF881248)));
extern volatile uint32_t        CFD2FIFOSTA5INV __attribute__((section("sfrs"),address(0xBF88124C)));
#define CFD2FIFOUA5 CFD2FIFOUA5
extern volatile uint32_t   CFD2FIFOUA5 __attribute__((section("sfrs"), address(0xBF881250)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA5bits_t;
