Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
extern volatile __CFD2FIFOCON27bits_t CFD2FIFOCON27bits __asm__ ("CFD2FIFOCON27") __attribute__((section("sfrs"), address(0xBF881650)));
extern volatile uint32_t        CFD2FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF881654)));
extern volatile uint32_t        CFD2FIFOCON27SET __attribute__((section("sfrs"),address(0xBF881658)));
extern volatile uint32_t        CFD2FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88165C)));
#define CFD2FIFOSTA27 CFD2FIFOSTA27
extern volatile uint32_t   CFD2FIFOSTA27 __attribute__((section("sfrs"), address(0xBF881660)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA27bits_t;
extern volatile __CFD2FIFOSTA27bits_t CFD2FIFOSTA27bits __asm__ ("CFD2FIFOSTA27") __attribute__((section("sfrs"), address(0xBF881660)));
extern volatile uint32_t        CFD2FIFOSTA27CLR __attribute__((section("sfrs"),address(0xBF881664)));
extern volatile uint32_t        CFD2FIFOSTA27SET __attribute__((section("sfrs"),address(0xBF881668)));
extern volatile uint32_t        CFD2FIFOSTA27INV __attribute__((section("sfrs"),address(0xBF88166C)));
#define CFD2FIFOUA27 CFD2FIFOUA27
extern volatile uint32_t   CFD2FIFOUA27 __attribute__((section("sfrs"), address(0xBF881670)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA27bits_t;
extern volatile __CFD2FIFOUA27bits_t CFD2FIFOUA27bits __asm__ ("CFD2FIFOUA27") __attribute__((section("sfrs"), address(0xBF881670)));
extern volatile uint32_t        CFD2FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF881674)));
extern volatile uint32_t        CFD2FIFOUA27SET __attribute__((section("sfrs"),address(0xBF881678)));
extern volatile uint32_t        CFD2FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88167C)));
#define CFD2FIFOCON28 CFD2FIFOCON28
extern volatile uint32_t   CFD2FIFOCON28 __attribute__((section("sfrs"), address(0xBF881680)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON28bits_t;
extern volatile __CFD2FIFOCON28bits_t CFD2FIFOCON28bits __asm__ ("CFD2FIFOCON28") __attribute__((section("sfrs"), address(0xBF881680)));
extern volatile uint32_t        CFD2FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF881684)));
extern volatile uint32_t        CFD2FIFOCON28SET __attribute__((section("sfrs"),address(0xBF881688)));
extern volatile uint32_t        CFD2FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88168C)));
#define CFD2FIFOSTA28 CFD2FIFOSTA28
extern volatile uint32_t   CFD2FIFOSTA28 __attribute__((section("sfrs"), address(0xBF881690)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA28bits_t;
extern volatile __CFD2FIFOSTA28bits_t CFD2FIFOSTA28bits __asm__ ("CFD2FIFOSTA28") __attribute__((section("sfrs"), address(0xBF881690)));
extern volatile uint32_t        CFD2FIFOSTA28CLR __attribute__((section("sfrs"),address(0xBF881694)));
extern volatile uint32_t        CFD2FIFOSTA28SET __attribute__((section("sfrs"),address(0xBF881698)));
extern volatile uint32_t        CFD2FIFOSTA28INV __attribute__((section("sfrs"),address(0xBF88169C)));
#define CFD2FIFOUA28 CFD2FIFOUA28
extern volatile uint32_t   CFD2FIFOUA28 __attribute__((section("sfrs"), address(0xBF8816A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA28bits_t;
extern volatile __CFD2FIFOUA28bits_t CFD2FIFOUA28bits __asm__ ("CFD2FIFOUA28") __attribute__((section("sfrs"), address(0xBF8816A0)));
extern volatile uint32_t        CFD2FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF8816A4)));
extern volatile uint32_t        CFD2FIFOUA28SET __attribute__((section("sfrs"),address(0xBF8816A8)));
extern volatile uint32_t        CFD2FIFOUA28INV __attribute__((section("sfrs"),address(0xBF8816AC)));
#define CFD2FIFOCON29 CFD2FIFOCON29
extern volatile uint32_t   CFD2FIFOCON29 __attribute__((section("sfrs"), address(0xBF8816B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON29bits_t;
extern volatile __CFD2FIFOCON29bits_t CFD2FIFOCON29bits __asm__ ("CFD2FIFOCON29") __attribute__((section("sfrs"), address(0xBF8816B0)));
extern volatile uint32_t        CFD2FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF8816B4)));
extern volatile uint32_t        CFD2FIFOCON29SET __attribute__((section("sfrs"),address(0xBF8816B8)));
extern volatile uint32_t        CFD2FIFOCON29INV __attribute__((section("sfrs"),address(0xBF8816BC)));
#define CFD2FIFOSTA29 CFD2FIFOSTA29
extern volatile uint32_t   CFD2FIFOSTA29 __attribute__((section("sfrs"), address(0xBF8816C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA29bits_t;
extern volatile __CFD2FIFOSTA29bits_t CFD2FIFOSTA29bits __asm__ ("CFD2FIFOSTA29") __attribute__((section("sfrs"), address(0xBF8816C0)));
extern volatile uint32_t        CFD2FIFOSTA29CLR __attribute__((section("sfrs"),address(0xBF8816C4)));
extern volatile uint32_t        CFD2FIFOSTA29SET __attribute__((section("sfrs"),address(0xBF8816C8)));
extern volatile uint32_t        CFD2FIFOSTA29INV __attribute__((section("sfrs"),address(0xBF8816CC)));
#define CFD2FIFOUA29 CFD2FIFOUA29
extern volatile uint32_t   CFD2FIFOUA29 __attribute__((section("sfrs"), address(0xBF8816D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA29bits_t;
