Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
extern volatile __CFD2MASK12bits_t CFD2MASK12bits __asm__ ("CFD2MASK12") __attribute__((section("sfrs"), address(0xBF881950)));
extern volatile uint32_t        CFD2MASK12CLR __attribute__((section("sfrs"),address(0xBF881954)));
extern volatile uint32_t        CFD2MASK12SET __attribute__((section("sfrs"),address(0xBF881958)));
extern volatile uint32_t        CFD2MASK12INV __attribute__((section("sfrs"),address(0xBF88195C)));
#define CFD2FLTOBJ13 CFD2FLTOBJ13
extern volatile uint32_t   CFD2FLTOBJ13 __attribute__((section("sfrs"), address(0xBF881960)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ13bits_t;
extern volatile __CFD2FLTOBJ13bits_t CFD2FLTOBJ13bits __asm__ ("CFD2FLTOBJ13") __attribute__((section("sfrs"), address(0xBF881960)));
extern volatile uint32_t        CFD2FLTOBJ13CLR __attribute__((section("sfrs"),address(0xBF881964)));
extern volatile uint32_t        CFD2FLTOBJ13SET __attribute__((section("sfrs"),address(0xBF881968)));
extern volatile uint32_t        CFD2FLTOBJ13INV __attribute__((section("sfrs"),address(0xBF88196C)));
#define CFD2MASK13 CFD2MASK13
extern volatile uint32_t   CFD2MASK13 __attribute__((section("sfrs"), address(0xBF881970)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK13bits_t;
extern volatile __CFD2MASK13bits_t CFD2MASK13bits __asm__ ("CFD2MASK13") __attribute__((section("sfrs"), address(0xBF881970)));
extern volatile uint32_t        CFD2MASK13CLR __attribute__((section("sfrs"),address(0xBF881974)));
extern volatile uint32_t        CFD2MASK13SET __attribute__((section("sfrs"),address(0xBF881978)));
extern volatile uint32_t        CFD2MASK13INV __attribute__((section("sfrs"),address(0xBF88197C)));
#define CFD2FLTOBJ14 CFD2FLTOBJ14
extern volatile uint32_t   CFD2FLTOBJ14 __attribute__((section("sfrs"), address(0xBF881980)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ14bits_t;
extern volatile __CFD2FLTOBJ14bits_t CFD2FLTOBJ14bits __asm__ ("CFD2FLTOBJ14") __attribute__((section("sfrs"), address(0xBF881980)));
extern volatile uint32_t        CFD2FLTOBJ14CLR __attribute__((section("sfrs"),address(0xBF881984)));
extern volatile uint32_t        CFD2FLTOBJ14SET __attribute__((section("sfrs"),address(0xBF881988)));
extern volatile uint32_t        CFD2FLTOBJ14INV __attribute__((section("sfrs"),address(0xBF88198C)));
#define CFD2MASK14 CFD2MASK14
extern volatile uint32_t   CFD2MASK14 __attribute__((section("sfrs"), address(0xBF881990)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK14bits_t;
extern volatile __CFD2MASK14bits_t CFD2MASK14bits __asm__ ("CFD2MASK14") __attribute__((section("sfrs"), address(0xBF881990)));
extern volatile uint32_t        CFD2MASK14CLR __attribute__((section("sfrs"),address(0xBF881994)));
extern volatile uint32_t        CFD2MASK14SET __attribute__((section("sfrs"),address(0xBF881998)));
extern volatile uint32_t        CFD2MASK14INV __attribute__((section("sfrs"),address(0xBF88199C)));
#define CFD2FLTOBJ15 CFD2FLTOBJ15
extern volatile uint32_t   CFD2FLTOBJ15 __attribute__((section("sfrs"), address(0xBF8819A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ15bits_t;
extern volatile __CFD2FLTOBJ15bits_t CFD2FLTOBJ15bits __asm__ ("CFD2FLTOBJ15") __attribute__((section("sfrs"), address(0xBF8819A0)));
extern volatile uint32_t        CFD2FLTOBJ15CLR __attribute__((section("sfrs"),address(0xBF8819A4)));
extern volatile uint32_t        CFD2FLTOBJ15SET __attribute__((section("sfrs"),address(0xBF8819A8)));
extern volatile uint32_t        CFD2FLTOBJ15INV __attribute__((section("sfrs"),address(0xBF8819AC)));
#define CFD2MASK15 CFD2MASK15
extern volatile uint32_t   CFD2MASK15 __attribute__((section("sfrs"), address(0xBF8819B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK15bits_t;
extern volatile __CFD2MASK15bits_t CFD2MASK15bits __asm__ ("CFD2MASK15") __attribute__((section("sfrs"), address(0xBF8819B0)));
extern volatile uint32_t        CFD2MASK15CLR __attribute__((section("sfrs"),address(0xBF8819B4)));
extern volatile uint32_t        CFD2MASK15SET __attribute__((section("sfrs"),address(0xBF8819B8)));
extern volatile uint32_t        CFD2MASK15INV __attribute__((section("sfrs"),address(0xBF8819BC)));
#define CFD2FLTOBJ16 CFD2FLTOBJ16
extern volatile uint32_t   CFD2FLTOBJ16 __attribute__((section("sfrs"), address(0xBF8819C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ16bits_t;
extern volatile __CFD2FLTOBJ16bits_t CFD2FLTOBJ16bits __asm__ ("CFD2FLTOBJ16") __attribute__((section("sfrs"), address(0xBF8819C0)));
extern volatile uint32_t        CFD2FLTOBJ16CLR __attribute__((section("sfrs"),address(0xBF8819C4)));
extern volatile uint32_t        CFD2FLTOBJ16SET __attribute__((section("sfrs"),address(0xBF8819C8)));
extern volatile uint32_t        CFD2FLTOBJ16INV __attribute__((section("sfrs"),address(0xBF8819CC)));
#define CFD2MASK16 CFD2MASK16
extern volatile uint32_t   CFD2MASK16 __attribute__((section("sfrs"), address(0xBF8819D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK16bits_t;
extern volatile __CFD2MASK16bits_t CFD2MASK16bits __asm__ ("CFD2MASK16") __attribute__((section("sfrs"), address(0xBF8819D0)));
extern volatile uint32_t        CFD2MASK16CLR __attribute__((section("sfrs"),address(0xBF8819D4)));
extern volatile uint32_t        CFD2MASK16SET __attribute__((section("sfrs"),address(0xBF8819D8)));
extern volatile uint32_t        CFD2MASK16INV __attribute__((section("sfrs"),address(0xBF8819DC)));
#define CFD2FLTOBJ17 CFD2FLTOBJ17
extern volatile uint32_t   CFD2FLTOBJ17 __attribute__((section("sfrs"), address(0xBF8819E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ17bits_t;
extern volatile __CFD2FLTOBJ17bits_t CFD2FLTOBJ17bits __asm__ ("CFD2FLTOBJ17") __attribute__((section("sfrs"), address(0xBF8819E0)));
extern volatile uint32_t        CFD2FLTOBJ17CLR __attribute__((section("sfrs"),address(0xBF8819E4)));
extern volatile uint32_t        CFD2FLTOBJ17SET __attribute__((section("sfrs"),address(0xBF8819E8)));
extern volatile uint32_t        CFD2FLTOBJ17INV __attribute__((section("sfrs"),address(0xBF8819EC)));
#define CFD2MASK17 CFD2MASK17
extern volatile uint32_t   CFD2MASK17 __attribute__((section("sfrs"), address(0xBF8819F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK17bits_t;
extern volatile __CFD2MASK17bits_t CFD2MASK17bits __asm__ ("CFD2MASK17") __attribute__((section("sfrs"), address(0xBF8819F0)));
extern volatile uint32_t        CFD2MASK17CLR __attribute__((section("sfrs"),address(0xBF8819F4)));
extern volatile uint32_t        CFD2MASK17SET __attribute__((section("sfrs"),address(0xBF8819F8)));
extern volatile uint32_t        CFD2MASK17INV __attribute__((section("sfrs"),address(0xBF8819FC)));
#define CFD2FLTOBJ18 CFD2FLTOBJ18
extern volatile uint32_t   CFD2FLTOBJ18 __attribute__((section("sfrs"), address(0xBF881A00)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ18bits_t;
extern volatile __CFD2FLTOBJ18bits_t CFD2FLTOBJ18bits __asm__ ("CFD2FLTOBJ18") __attribute__((section("sfrs"), address(0xBF881A00)));
extern volatile uint32_t        CFD2FLTOBJ18CLR __attribute__((section("sfrs"),address(0xBF881A04)));
extern volatile uint32_t        CFD2FLTOBJ18SET __attribute__((section("sfrs"),address(0xBF881A08)));
extern volatile uint32_t        CFD2FLTOBJ18INV __attribute__((section("sfrs"),address(0xBF881A0C)));
#define CFD2MASK18 CFD2MASK18
extern volatile uint32_t   CFD2MASK18 __attribute__((section("sfrs"), address(0xBF881A10)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK18bits_t;
extern volatile __CFD2MASK18bits_t CFD2MASK18bits __asm__ ("CFD2MASK18") __attribute__((section("sfrs"), address(0xBF881A10)));
extern volatile uint32_t        CFD2MASK18CLR __attribute__((section("sfrs"),address(0xBF881A14)));
extern volatile uint32_t        CFD2MASK18SET __attribute__((section("sfrs"),address(0xBF881A18)));
extern volatile uint32_t        CFD2MASK18INV __attribute__((section("sfrs"),address(0xBF881A1C)));
#define CFD2FLTOBJ19 CFD2FLTOBJ19
extern volatile uint32_t   CFD2FLTOBJ19 __attribute__((section("sfrs"), address(0xBF881A20)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ19bits_t;
extern volatile __CFD2FLTOBJ19bits_t CFD2FLTOBJ19bits __asm__ ("CFD2FLTOBJ19") __attribute__((section("sfrs"), address(0xBF881A20)));
extern volatile uint32_t        CFD2FLTOBJ19CLR __attribute__((section("sfrs"),address(0xBF881A24)));
extern volatile uint32_t        CFD2FLTOBJ19SET __attribute__((section("sfrs"),address(0xBF881A28)));
extern volatile uint32_t        CFD2FLTOBJ19INV __attribute__((section("sfrs"),address(0xBF881A2C)));
#define CFD2MASK19 CFD2MASK19
extern volatile uint32_t   CFD2MASK19 __attribute__((section("sfrs"), address(0xBF881A30)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK19bits_t;
