Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
extern volatile __CFD3FIFOCON18bits_t CFD3FIFOCON18bits __asm__ ("CFD3FIFOCON18") __attribute__((section("sfrs"), address(0xBF8844A0)));
extern volatile uint32_t        CFD3FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8844A4)));
extern volatile uint32_t        CFD3FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8844A8)));
extern volatile uint32_t        CFD3FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8844AC)));
#define CFD3FIFOSTA18 CFD3FIFOSTA18
extern volatile uint32_t   CFD3FIFOSTA18 __attribute__((section("sfrs"), address(0xBF8844B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA18bits_t;
extern volatile __CFD3FIFOSTA18bits_t CFD3FIFOSTA18bits __asm__ ("CFD3FIFOSTA18") __attribute__((section("sfrs"), address(0xBF8844B0)));
extern volatile uint32_t        CFD3FIFOSTA18CLR __attribute__((section("sfrs"),address(0xBF8844B4)));
extern volatile uint32_t        CFD3FIFOSTA18SET __attribute__((section("sfrs"),address(0xBF8844B8)));
extern volatile uint32_t        CFD3FIFOSTA18INV __attribute__((section("sfrs"),address(0xBF8844BC)));
#define CFD3FIFOUA18 CFD3FIFOUA18
extern volatile uint32_t   CFD3FIFOUA18 __attribute__((section("sfrs"), address(0xBF8844C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA18bits_t;
extern volatile __CFD3FIFOUA18bits_t CFD3FIFOUA18bits __asm__ ("CFD3FIFOUA18") __attribute__((section("sfrs"), address(0xBF8844C0)));
extern volatile uint32_t        CFD3FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8844C4)));
extern volatile uint32_t        CFD3FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8844C8)));
extern volatile uint32_t        CFD3FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8844CC)));
#define CFD3FIFOCON19 CFD3FIFOCON19
extern volatile uint32_t   CFD3FIFOCON19 __attribute__((section("sfrs"), address(0xBF8844D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON19bits_t;
extern volatile __CFD3FIFOCON19bits_t CFD3FIFOCON19bits __asm__ ("CFD3FIFOCON19") __attribute__((section("sfrs"), address(0xBF8844D0)));
extern volatile uint32_t        CFD3FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF8844D4)));
extern volatile uint32_t        CFD3FIFOCON19SET __attribute__((section("sfrs"),address(0xBF8844D8)));
extern volatile uint32_t        CFD3FIFOCON19INV __attribute__((section("sfrs"),address(0xBF8844DC)));
#define CFD3FIFOSTA19 CFD3FIFOSTA19
extern volatile uint32_t   CFD3FIFOSTA19 __attribute__((section("sfrs"), address(0xBF8844E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA19bits_t;
extern volatile __CFD3FIFOSTA19bits_t CFD3FIFOSTA19bits __asm__ ("CFD3FIFOSTA19") __attribute__((section("sfrs"), address(0xBF8844E0)));
extern volatile uint32_t        CFD3FIFOSTA19CLR __attribute__((section("sfrs"),address(0xBF8844E4)));
extern volatile uint32_t        CFD3FIFOSTA19SET __attribute__((section("sfrs"),address(0xBF8844E8)));
extern volatile uint32_t        CFD3FIFOSTA19INV __attribute__((section("sfrs"),address(0xBF8844EC)));
#define CFD3FIFOUA19 CFD3FIFOUA19
extern volatile uint32_t   CFD3FIFOUA19 __attribute__((section("sfrs"), address(0xBF8844F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA19bits_t;
extern volatile __CFD3FIFOUA19bits_t CFD3FIFOUA19bits __asm__ ("CFD3FIFOUA19") __attribute__((section("sfrs"), address(0xBF8844F0)));
extern volatile uint32_t        CFD3FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF8844F4)));
extern volatile uint32_t        CFD3FIFOUA19SET __attribute__((section("sfrs"),address(0xBF8844F8)));
extern volatile uint32_t        CFD3FIFOUA19INV __attribute__((section("sfrs"),address(0xBF8844FC)));
#define CFD3FIFOCON20 CFD3FIFOCON20
extern volatile uint32_t   CFD3FIFOCON20 __attribute__((section("sfrs"), address(0xBF884500)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON20bits_t;
extern volatile __CFD3FIFOCON20bits_t CFD3FIFOCON20bits __asm__ ("CFD3FIFOCON20") __attribute__((section("sfrs"), address(0xBF884500)));
extern volatile uint32_t        CFD3FIFOCON20CLR __attribute__((section("sfrs"),address(0xBF884504)));
extern volatile uint32_t        CFD3FIFOCON20SET __attribute__((section("sfrs"),address(0xBF884508)));
extern volatile uint32_t        CFD3FIFOCON20INV __attribute__((section("sfrs"),address(0xBF88450C)));
#define CFD3FIFOSTA20 CFD3FIFOSTA20
extern volatile uint32_t   CFD3FIFOSTA20 __attribute__((section("sfrs"), address(0xBF884510)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA20bits_t;
extern volatile __CFD3FIFOSTA20bits_t CFD3FIFOSTA20bits __asm__ ("CFD3FIFOSTA20") __attribute__((section("sfrs"), address(0xBF884510)));
extern volatile uint32_t        CFD3FIFOSTA20CLR __attribute__((section("sfrs"),address(0xBF884514)));
extern volatile uint32_t        CFD3FIFOSTA20SET __attribute__((section("sfrs"),address(0xBF884518)));
extern volatile uint32_t        CFD3FIFOSTA20INV __attribute__((section("sfrs"),address(0xBF88451C)));
#define CFD3FIFOUA20 CFD3FIFOUA20
extern volatile uint32_t   CFD3FIFOUA20 __attribute__((section("sfrs"), address(0xBF884520)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA20bits_t;
