Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
extern volatile __CFD4FIFOCON1bits_t CFD4FIFOCON1bits __asm__ ("CFD4FIFOCON1") __attribute__((section("sfrs"), address(0xBF885170)));
extern volatile uint32_t        CFD4FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF885174)));
extern volatile uint32_t        CFD4FIFOCON1SET __attribute__((section("sfrs"),address(0xBF885178)));
extern volatile uint32_t        CFD4FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88517C)));
#define CFD4FIFOSTA1 CFD4FIFOSTA1
extern volatile uint32_t   CFD4FIFOSTA1 __attribute__((section("sfrs"), address(0xBF885180)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA1bits_t;
extern volatile __CFD4FIFOSTA1bits_t CFD4FIFOSTA1bits __asm__ ("CFD4FIFOSTA1") __attribute__((section("sfrs"), address(0xBF885180)));
extern volatile uint32_t        CFD4FIFOSTA1CLR __attribute__((section("sfrs"),address(0xBF885184)));
extern volatile uint32_t        CFD4FIFOSTA1SET __attribute__((section("sfrs"),address(0xBF885188)));
extern volatile uint32_t        CFD4FIFOSTA1INV __attribute__((section("sfrs"),address(0xBF88518C)));
#define CFD4FIFOUA1 CFD4FIFOUA1
extern volatile uint32_t   CFD4FIFOUA1 __attribute__((section("sfrs"), address(0xBF885190)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA1bits_t;
extern volatile __CFD4FIFOUA1bits_t CFD4FIFOUA1bits __asm__ ("CFD4FIFOUA1") __attribute__((section("sfrs"), address(0xBF885190)));
extern volatile uint32_t        CFD4FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF885194)));
extern volatile uint32_t        CFD4FIFOUA1SET __attribute__((section("sfrs"),address(0xBF885198)));
extern volatile uint32_t        CFD4FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88519C)));
#define CFD4FIFOCON2 CFD4FIFOCON2
extern volatile uint32_t   CFD4FIFOCON2 __attribute__((section("sfrs"), address(0xBF8851A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON2bits_t;
extern volatile __CFD4FIFOCON2bits_t CFD4FIFOCON2bits __asm__ ("CFD4FIFOCON2") __attribute__((section("sfrs"), address(0xBF8851A0)));
extern volatile uint32_t        CFD4FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8851A4)));
extern volatile uint32_t        CFD4FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8851A8)));
extern volatile uint32_t        CFD4FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8851AC)));
#define CFD4FIFOSTA2 CFD4FIFOSTA2
extern volatile uint32_t   CFD4FIFOSTA2 __attribute__((section("sfrs"), address(0xBF8851B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA2bits_t;
extern volatile __CFD4FIFOSTA2bits_t CFD4FIFOSTA2bits __asm__ ("CFD4FIFOSTA2") __attribute__((section("sfrs"), address(0xBF8851B0)));
extern volatile uint32_t        CFD4FIFOSTA2CLR __attribute__((section("sfrs"),address(0xBF8851B4)));
extern volatile uint32_t        CFD4FIFOSTA2SET __attribute__((section("sfrs"),address(0xBF8851B8)));
extern volatile uint32_t        CFD4FIFOSTA2INV __attribute__((section("sfrs"),address(0xBF8851BC)));
#define CFD4FIFOUA2 CFD4FIFOUA2
extern volatile uint32_t   CFD4FIFOUA2 __attribute__((section("sfrs"), address(0xBF8851C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA2bits_t;
extern volatile __CFD4FIFOUA2bits_t CFD4FIFOUA2bits __asm__ ("CFD4FIFOUA2") __attribute__((section("sfrs"), address(0xBF8851C0)));
extern volatile uint32_t        CFD4FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8851C4)));
extern volatile uint32_t        CFD4FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8851C8)));
extern volatile uint32_t        CFD4FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8851CC)));
#define CFD4FIFOCON3 CFD4FIFOCON3
extern volatile uint32_t   CFD4FIFOCON3 __attribute__((section("sfrs"), address(0xBF8851D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON3bits_t;
extern volatile __CFD4FIFOCON3bits_t CFD4FIFOCON3bits __asm__ ("CFD4FIFOCON3") __attribute__((section("sfrs"), address(0xBF8851D0)));
extern volatile uint32_t        CFD4FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF8851D4)));
extern volatile uint32_t        CFD4FIFOCON3SET __attribute__((section("sfrs"),address(0xBF8851D8)));
extern volatile uint32_t        CFD4FIFOCON3INV __attribute__((section("sfrs"),address(0xBF8851DC)));
#define CFD4FIFOSTA3 CFD4FIFOSTA3
extern volatile uint32_t   CFD4FIFOSTA3 __attribute__((section("sfrs"), address(0xBF8851E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA3bits_t;
extern volatile __CFD4FIFOSTA3bits_t CFD4FIFOSTA3bits __asm__ ("CFD4FIFOSTA3") __attribute__((section("sfrs"), address(0xBF8851E0)));
extern volatile uint32_t        CFD4FIFOSTA3CLR __attribute__((section("sfrs"),address(0xBF8851E4)));
extern volatile uint32_t        CFD4FIFOSTA3SET __attribute__((section("sfrs"),address(0xBF8851E8)));
extern volatile uint32_t        CFD4FIFOSTA3INV __attribute__((section("sfrs"),address(0xBF8851EC)));
#define CFD4FIFOUA3 CFD4FIFOUA3
extern volatile uint32_t   CFD4FIFOUA3 __attribute__((section("sfrs"), address(0xBF8851F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA3bits_t;
extern volatile __CFD4FIFOUA3bits_t CFD4FIFOUA3bits __asm__ ("CFD4FIFOUA3") __attribute__((section("sfrs"), address(0xBF8851F0)));
extern volatile uint32_t        CFD4FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF8851F4)));
extern volatile uint32_t        CFD4FIFOUA3SET __attribute__((section("sfrs"),address(0xBF8851F8)));
extern volatile uint32_t        CFD4FIFOUA3INV __attribute__((section("sfrs"),address(0xBF8851FC)));
#define CFD4FIFOCON4 CFD4FIFOCON4
extern volatile uint32_t   CFD4FIFOCON4 __attribute__((section("sfrs"), address(0xBF885200)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON4bits_t;
extern volatile __CFD4FIFOCON4bits_t CFD4FIFOCON4bits __asm__ ("CFD4FIFOCON4") __attribute__((section("sfrs"), address(0xBF885200)));
extern volatile uint32_t        CFD4FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF885204)));
extern volatile uint32_t        CFD4FIFOCON4SET __attribute__((section("sfrs"),address(0xBF885208)));
extern volatile uint32_t        CFD4FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88520C)));
#define CFD4FIFOSTA4 CFD4FIFOSTA4
extern volatile uint32_t   CFD4FIFOSTA4 __attribute__((section("sfrs"), address(0xBF885210)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA4bits_t;
extern volatile __CFD4FIFOSTA4bits_t CFD4FIFOSTA4bits __asm__ ("CFD4FIFOSTA4") __attribute__((section("sfrs"), address(0xBF885210)));
extern volatile uint32_t        CFD4FIFOSTA4CLR __attribute__((section("sfrs"),address(0xBF885214)));
extern volatile uint32_t        CFD4FIFOSTA4SET __attribute__((section("sfrs"),address(0xBF885218)));
extern volatile uint32_t        CFD4FIFOSTA4INV __attribute__((section("sfrs"),address(0xBF88521C)));
#define CFD4FIFOUA4 CFD4FIFOUA4
extern volatile uint32_t   CFD4FIFOUA4 __attribute__((section("sfrs"), address(0xBF885220)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA4bits_t;
extern volatile __CFD4FIFOUA4bits_t CFD4FIFOUA4bits __asm__ ("CFD4FIFOUA4") __attribute__((section("sfrs"), address(0xBF885220)));
extern volatile uint32_t        CFD4FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF885224)));
extern volatile uint32_t        CFD4FIFOUA4SET __attribute__((section("sfrs"),address(0xBF885228)));
extern volatile uint32_t        CFD4FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88522C)));
#define CFD4FIFOCON5 CFD4FIFOCON5
extern volatile uint32_t   CFD4FIFOCON5 __attribute__((section("sfrs"), address(0xBF885230)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD4FIFOCON5bits_t;
extern volatile __CFD4FIFOCON5bits_t CFD4FIFOCON5bits __asm__ ("CFD4FIFOCON5") __attribute__((section("sfrs"), address(0xBF885230)));
extern volatile uint32_t        CFD4FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF885234)));
extern volatile uint32_t        CFD4FIFOCON5SET __attribute__((section("sfrs"),address(0xBF885238)));
extern volatile uint32_t        CFD4FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88523C)));
#define CFD4FIFOSTA5 CFD4FIFOSTA5
extern volatile uint32_t   CFD4FIFOSTA5 __attribute__((section("sfrs"), address(0xBF885240)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD4FIFOSTA5bits_t;
extern volatile __CFD4FIFOSTA5bits_t CFD4FIFOSTA5bits __asm__ ("CFD4FIFOSTA5") __attribute__((section("sfrs"), address(0xBF885240)));
extern volatile uint32_t        CFD4FIFOSTA5CLR __attribute__((section("sfrs"),address(0xBF885244)));
extern volatile uint32_t        CFD4FIFOSTA5SET __attribute__((section("sfrs"),address(0xBF885248)));
extern volatile uint32_t        CFD4FIFOSTA5INV __attribute__((section("sfrs"),address(0xBF88524C)));
#define CFD4FIFOUA5 CFD4FIFOUA5
extern volatile uint32_t   CFD4FIFOUA5 __attribute__((section("sfrs"), address(0xBF885250)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD4FIFOUA5bits_t;
