Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
#define _PMWADDR_WCSA_POSITION                   0x00000016
#define _PMWADDR_WCSA_MASK                       0x00C00000
#define _PMWADDR_WCSA_LENGTH                     0x00000002

#define _PMWADDR_WCS1_POSITION                   0x0000000E
#define _PMWADDR_WCS1_MASK                       0x00004000
#define _PMWADDR_WCS1_LENGTH                     0x00000001

#define _PMWADDR_WCS2_POSITION                   0x0000000F
#define _PMWADDR_WCS2_MASK                       0x00008000
#define _PMWADDR_WCS2_LENGTH                     0x00000001

#define _PMWADDR_WCS1A_POSITION                  0x00000016
#define _PMWADDR_WCS1A_MASK                      0x00400000
#define _PMWADDR_WCS1A_LENGTH                    0x00000001

#define _PMWADDR_WCS2A_POSITION                  0x00000017
#define _PMWADDR_WCS2A_MASK                      0x00800000
#define _PMWADDR_WCS2A_LENGTH                    0x00000001

#define _PMWADDR_w_POSITION                      0x00000000
#define _PMWADDR_w_MASK                          0xFFFFFFFF
#define _PMWADDR_w_LENGTH                        0x00000020

#define _PMWADDR_WADDR14_POSITION                0x0000000E
#define _PMWADDR_WADDR14_MASK                    0x00004000
#define _PMWADDR_WADDR14_LENGTH                  0x00000001

#define _PMWADDR_WADDR15_POSITION                0x0000000F
#define _PMWADDR_WADDR15_MASK                    0x00008000
#define _PMWADDR_WADDR15_LENGTH                  0x00000001

#define _PMWADDR_WADDR22_POSITION                0x00000016
#define _PMWADDR_WADDR22_MASK                    0x00400000
#define _PMWADDR_WADDR22_LENGTH                  0x00000001

#define _PMWADDR_WADDR23_POSITION                0x00000017
#define _PMWADDR_WADDR23_MASK                    0x00800000
#define _PMWADDR_WADDR23_LENGTH                  0x00000001

#define _PMRADDR_RADDR_POSITION                  0x00000000
#define _PMRADDR_RADDR_MASK                      0x00003FFF
#define _PMRADDR_RADDR_LENGTH                    0x0000000E

#define _PMRADDR_RADDR14_POSITION                0x0000000E
#define _PMRADDR_RADDR14_MASK                    0x00004000
#define _PMRADDR_RADDR14_LENGTH                  0x00000001

#define _PMRADDR_RADDR15_POSITION                0x0000000F
#define _PMRADDR_RADDR15_MASK                    0x00008000
#define _PMRADDR_RADDR15_LENGTH                  0x00000001

#define _PMRADDR_RCS_POSITION                    0x0000000E
#define _PMRADDR_RCS_MASK                        0x0000C000
#define _PMRADDR_RCS_LENGTH                      0x00000002

#define _PMRADDR_RCS1_POSITION                   0x0000000E
#define _PMRADDR_RCS1_MASK                       0x00004000
#define _PMRADDR_RCS1_LENGTH                     0x00000001

#define _PMRADDR_RCS2_POSITION                   0x0000000F
#define _PMRADDR_RCS2_MASK                       0x00008000
#define _PMRADDR_RCS2_LENGTH                     0x00000001

#define _PMRADDR_w_POSITION                      0x00000000
#define _PMRADDR_w_MASK                          0xFFFFFFFF
#define _PMRADDR_w_LENGTH                        0x00000020

#define _PMRDIN_RDATAIN_POSITION                 0x00000000
#define _PMRDIN_RDATAIN_MASK                     0xFFFFFFFF
#define _PMRDIN_RDATAIN_LENGTH                   0x00000020

#define _PMRDIN_w_POSITION                       0x00000000
#define _PMRDIN_w_MASK                           0xFFFFFFFF
#define _PMRDIN_w_LENGTH                         0x00000020

#define _IC10CON_ICM_POSITION                    0x00000000
#define _IC10CON_ICM_MASK                        0x00000007
#define _IC10CON_ICM_LENGTH                      0x00000003

#define _IC10CON_ICBNE_POSITION                  0x00000003
#define _IC10CON_ICBNE_MASK                      0x00000008
#define _IC10CON_ICBNE_LENGTH                    0x00000001

#define _IC10CON_ICOV_POSITION                   0x00000004
#define _IC10CON_ICOV_MASK                       0x00000010
#define _IC10CON_ICOV_LENGTH                     0x00000001

#define _IC10CON_ICI_POSITION                    0x00000005
#define _IC10CON_ICI_MASK                        0x00000060
#define _IC10CON_ICI_LENGTH                      0x00000002

#define _IC10CON_ICTMR_POSITION                  0x00000007
#define _IC10CON_ICTMR_MASK                      0x00000080
#define _IC10CON_ICTMR_LENGTH                    0x00000001

#define _IC10CON_C32_POSITION                    0x00000008
#define _IC10CON_C32_MASK                        0x00000100
#define _IC10CON_C32_LENGTH                      0x00000001

#define _IC10CON_FEDGE_POSITION                  0x00000009
#define _IC10CON_FEDGE_MASK                      0x00000200
#define _IC10CON_FEDGE_LENGTH                    0x00000001

#define _IC10CON_SIDL_POSITION                   0x0000000D
#define _IC10CON_SIDL_MASK                       0x00002000
#define _IC10CON_SIDL_LENGTH                     0x00000001

#define _IC10CON_ON_POSITION                     0x0000000F
#define _IC10CON_ON_MASK                         0x00008000
#define _IC10CON_ON_LENGTH                       0x00000001

#define _IC10CON_ICM0_POSITION                   0x00000000
#define _IC10CON_ICM0_MASK                       0x00000001
#define _IC10CON_ICM0_LENGTH                     0x00000001

#define _IC10CON_ICM1_POSITION                   0x00000001
#define _IC10CON_ICM1_MASK                       0x00000002
#define _IC10CON_ICM1_LENGTH                     0x00000001

#define _IC10CON_ICM2_POSITION                   0x00000002
#define _IC10CON_ICM2_MASK                       0x00000004
#define _IC10CON_ICM2_LENGTH                     0x00000001

#define _IC10CON_ICI0_POSITION                   0x00000005
#define _IC10CON_ICI0_MASK                       0x00000020
#define _IC10CON_ICI0_LENGTH                     0x00000001

#define _IC10CON_ICI1_POSITION                   0x00000006
#define _IC10CON_ICI1_MASK                       0x00000040
#define _IC10CON_ICI1_LENGTH                     0x00000001

#define _IC10CON_ICSIDL_POSITION                 0x0000000D
#define _IC10CON_ICSIDL_MASK                     0x00002000
#define _IC10CON_ICSIDL_LENGTH                   0x00000001

#define _IC10CON_w_POSITION                      0x00000000
#define _IC10CON_w_MASK                          0xFFFFFFFF
#define _IC10CON_w_LENGTH                        0x00000020

