Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
#define _CFD2FIFOCON4_TXREQ_POSITION             0x00000009
#define _CFD2FIFOCON4_TXREQ_MASK                 0x00000200
#define _CFD2FIFOCON4_TXREQ_LENGTH               0x00000001

#define _CFD2FIFOCON4_FRESET_POSITION            0x0000000A
#define _CFD2FIFOCON4_FRESET_MASK                0x00000400
#define _CFD2FIFOCON4_FRESET_LENGTH              0x00000001

#define _CFD2FIFOCON4_TXPRI_POSITION             0x00000010
#define _CFD2FIFOCON4_TXPRI_MASK                 0x001F0000
#define _CFD2FIFOCON4_TXPRI_LENGTH               0x00000005

#define _CFD2FIFOCON4_TXAT_POSITION              0x00000015
#define _CFD2FIFOCON4_TXAT_MASK                  0x00600000
#define _CFD2FIFOCON4_TXAT_LENGTH                0x00000002

#define _CFD2FIFOCON4_FSIZE_POSITION             0x00000018
#define _CFD2FIFOCON4_FSIZE_MASK                 0x1F000000
#define _CFD2FIFOCON4_FSIZE_LENGTH               0x00000005

#define _CFD2FIFOCON4_PLSIZE_POSITION            0x0000001D
#define _CFD2FIFOCON4_PLSIZE_MASK                0xE0000000
#define _CFD2FIFOCON4_PLSIZE_LENGTH              0x00000003

#define _CFD2FIFOSTA4_TFNRFNIF_POSITION          0x00000000
#define _CFD2FIFOSTA4_TFNRFNIF_MASK              0x00000001
#define _CFD2FIFOSTA4_TFNRFNIF_LENGTH            0x00000001

#define _CFD2FIFOSTA4_TFHRFHIF_POSITION          0x00000001
#define _CFD2FIFOSTA4_TFHRFHIF_MASK              0x00000002
#define _CFD2FIFOSTA4_TFHRFHIF_LENGTH            0x00000001

#define _CFD2FIFOSTA4_TFERFFIF_POSITION          0x00000002
#define _CFD2FIFOSTA4_TFERFFIF_MASK              0x00000004
#define _CFD2FIFOSTA4_TFERFFIF_LENGTH            0x00000001

#define _CFD2FIFOSTA4_RXOVIF_POSITION            0x00000003
#define _CFD2FIFOSTA4_RXOVIF_MASK                0x00000008
#define _CFD2FIFOSTA4_RXOVIF_LENGTH              0x00000001

#define _CFD2FIFOSTA4_TXATIF_POSITION            0x00000004
#define _CFD2FIFOSTA4_TXATIF_MASK                0x00000010
#define _CFD2FIFOSTA4_TXATIF_LENGTH              0x00000001

#define _CFD2FIFOSTA4_TXERR_POSITION             0x00000005
#define _CFD2FIFOSTA4_TXERR_MASK                 0x00000020
#define _CFD2FIFOSTA4_TXERR_LENGTH               0x00000001

#define _CFD2FIFOSTA4_TXLARB_POSITION            0x00000006
#define _CFD2FIFOSTA4_TXLARB_MASK                0x00000040
#define _CFD2FIFOSTA4_TXLARB_LENGTH              0x00000001

#define _CFD2FIFOSTA4_TXABT_POSITION             0x00000007
#define _CFD2FIFOSTA4_TXABT_MASK                 0x00000080
#define _CFD2FIFOSTA4_TXABT_LENGTH               0x00000001

#define _CFD2FIFOSTA4_FIFOCI_POSITION            0x00000008
#define _CFD2FIFOSTA4_FIFOCI_MASK                0x00001F00
#define _CFD2FIFOSTA4_FIFOCI_LENGTH              0x00000005

#define _CFD2FIFOUA4_FIFOUA_POSITION             0x00000000
#define _CFD2FIFOUA4_FIFOUA_MASK                 0xFFFFFFFF
#define _CFD2FIFOUA4_FIFOUA_LENGTH               0x00000020

#define _CFD2FIFOCON5_TFNRFNIE_POSITION          0x00000000
#define _CFD2FIFOCON5_TFNRFNIE_MASK              0x00000001
#define _CFD2FIFOCON5_TFNRFNIE_LENGTH            0x00000001

#define _CFD2FIFOCON5_TFHRFHIE_POSITION          0x00000001
#define _CFD2FIFOCON5_TFHRFHIE_MASK              0x00000002
#define _CFD2FIFOCON5_TFHRFHIE_LENGTH            0x00000001

#define _CFD2FIFOCON5_TFERFFIE_POSITION          0x00000002
#define _CFD2FIFOCON5_TFERFFIE_MASK              0x00000004
#define _CFD2FIFOCON5_TFERFFIE_LENGTH            0x00000001

#define _CFD2FIFOCON5_RXOVIE_POSITION            0x00000003
#define _CFD2FIFOCON5_RXOVIE_MASK                0x00000008
#define _CFD2FIFOCON5_RXOVIE_LENGTH              0x00000001

#define _CFD2FIFOCON5_TXATIE_POSITION            0x00000004
#define _CFD2FIFOCON5_TXATIE_MASK                0x00000010
#define _CFD2FIFOCON5_TXATIE_LENGTH              0x00000001

#define _CFD2FIFOCON5_RXTSEN_POSITION            0x00000005
#define _CFD2FIFOCON5_RXTSEN_MASK                0x00000020
#define _CFD2FIFOCON5_RXTSEN_LENGTH              0x00000001

#define _CFD2FIFOCON5_RTREN_POSITION             0x00000006
#define _CFD2FIFOCON5_RTREN_MASK                 0x00000040
#define _CFD2FIFOCON5_RTREN_LENGTH               0x00000001

#define _CFD2FIFOCON5_TXEN_POSITION              0x00000007
#define _CFD2FIFOCON5_TXEN_MASK                  0x00000080
#define _CFD2FIFOCON5_TXEN_LENGTH                0x00000001

#define _CFD2FIFOCON5_UINC_POSITION              0x00000008
#define _CFD2FIFOCON5_UINC_MASK                  0x00000100
#define _CFD2FIFOCON5_UINC_LENGTH                0x00000001

#define _CFD2FIFOCON5_TXREQ_POSITION             0x00000009
#define _CFD2FIFOCON5_TXREQ_MASK                 0x00000200
#define _CFD2FIFOCON5_TXREQ_LENGTH               0x00000001

#define _CFD2FIFOCON5_FRESET_POSITION            0x0000000A
#define _CFD2FIFOCON5_FRESET_MASK                0x00000400
#define _CFD2FIFOCON5_FRESET_LENGTH              0x00000001

#define _CFD2FIFOCON5_TXPRI_POSITION             0x00000010
#define _CFD2FIFOCON5_TXPRI_MASK                 0x001F0000
#define _CFD2FIFOCON5_TXPRI_LENGTH               0x00000005

#define _CFD2FIFOCON5_TXAT_POSITION              0x00000015
#define _CFD2FIFOCON5_TXAT_MASK                  0x00600000
#define _CFD2FIFOCON5_TXAT_LENGTH                0x00000002

#define _CFD2FIFOCON5_FSIZE_POSITION             0x00000018
#define _CFD2FIFOCON5_FSIZE_MASK                 0x1F000000
#define _CFD2FIFOCON5_FSIZE_LENGTH               0x00000005

#define _CFD2FIFOCON5_PLSIZE_POSITION            0x0000001D
#define _CFD2FIFOCON5_PLSIZE_MASK                0xE0000000
#define _CFD2FIFOCON5_PLSIZE_LENGTH              0x00000003

#define _CFD2FIFOSTA5_TFNRFNIF_POSITION          0x00000000
#define _CFD2FIFOSTA5_TFNRFNIF_MASK              0x00000001
#define _CFD2FIFOSTA5_TFNRFNIF_LENGTH            0x00000001

#define _CFD2FIFOSTA5_TFHRFHIF_POSITION          0x00000001
#define _CFD2FIFOSTA5_TFHRFHIF_MASK              0x00000002
#define _CFD2FIFOSTA5_TFHRFHIF_LENGTH            0x00000001

#define _CFD2FIFOSTA5_TFERFFIF_POSITION          0x00000002
#define _CFD2FIFOSTA5_TFERFFIF_MASK              0x00000004
#define _CFD2FIFOSTA5_TFERFFIF_LENGTH            0x00000001

#define _CFD2FIFOSTA5_RXOVIF_POSITION            0x00000003
#define _CFD2FIFOSTA5_RXOVIF_MASK                0x00000008
#define _CFD2FIFOSTA5_RXOVIF_LENGTH              0x00000001

