Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
#define _CFD4TREC_TXBP_POSITION                  0x00000014
#define _CFD4TREC_TXBP_MASK                      0x00100000
#define _CFD4TREC_TXBP_LENGTH                    0x00000001

#define _CFD4TREC_TXBO_POSITION                  0x00000015
#define _CFD4TREC_TXBO_MASK                      0x00200000
#define _CFD4TREC_TXBO_LENGTH                    0x00000001

#define _CFD4TREC_w_POSITION                     0x00000000
#define _CFD4TREC_w_MASK                         0xFFFFFFFF
#define _CFD4TREC_w_LENGTH                       0x00000020

#define _CFD4BDIAG0_NRERRCNT_POSITION            0x00000000
#define _CFD4BDIAG0_NRERRCNT_MASK                0x000000FF
#define _CFD4BDIAG0_NRERRCNT_LENGTH              0x00000008

#define _CFD4BDIAG0_NTERRCNT_POSITION            0x00000008
#define _CFD4BDIAG0_NTERRCNT_MASK                0x0000FF00
#define _CFD4BDIAG0_NTERRCNT_LENGTH              0x00000008

#define _CFD4BDIAG0_DRERRCNT_POSITION            0x00000010
#define _CFD4BDIAG0_DRERRCNT_MASK                0x00FF0000
#define _CFD4BDIAG0_DRERRCNT_LENGTH              0x00000008

#define _CFD4BDIAG0_DTERRCNT_POSITION            0x00000018
#define _CFD4BDIAG0_DTERRCNT_MASK                0xFF000000
#define _CFD4BDIAG0_DTERRCNT_LENGTH              0x00000008

#define _CFD4BDIAG1_EFMSGCNT_POSITION            0x00000000
#define _CFD4BDIAG1_EFMSGCNT_MASK                0x0000FFFF
#define _CFD4BDIAG1_EFMSGCNT_LENGTH              0x00000010

#define _CFD4BDIAG1_NBIT0ERR_POSITION            0x00000010
#define _CFD4BDIAG1_NBIT0ERR_MASK                0x00010000
#define _CFD4BDIAG1_NBIT0ERR_LENGTH              0x00000001

#define _CFD4BDIAG1_NBIT1ERR_POSITION            0x00000011
#define _CFD4BDIAG1_NBIT1ERR_MASK                0x00020000
#define _CFD4BDIAG1_NBIT1ERR_LENGTH              0x00000001

#define _CFD4BDIAG1_NACKERR_POSITION             0x00000012
#define _CFD4BDIAG1_NACKERR_MASK                 0x00040000
#define _CFD4BDIAG1_NACKERR_LENGTH               0x00000001

#define _CFD4BDIAG1_NFORMERR_POSITION            0x00000013
#define _CFD4BDIAG1_NFORMERR_MASK                0x00080000
#define _CFD4BDIAG1_NFORMERR_LENGTH              0x00000001

#define _CFD4BDIAG1_NSTUFERR_POSITION            0x00000014
#define _CFD4BDIAG1_NSTUFERR_MASK                0x00100000
#define _CFD4BDIAG1_NSTUFERR_LENGTH              0x00000001

#define _CFD4BDIAG1_NCRCERR_POSITION             0x00000015
#define _CFD4BDIAG1_NCRCERR_MASK                 0x00200000
#define _CFD4BDIAG1_NCRCERR_LENGTH               0x00000001

#define _CFD4BDIAG1_DBIT0ERR_POSITION            0x00000018
#define _CFD4BDIAG1_DBIT0ERR_MASK                0x01000000
#define _CFD4BDIAG1_DBIT0ERR_LENGTH              0x00000001

#define _CFD4BDIAG1_DBIT1ERR_POSITION            0x00000019
#define _CFD4BDIAG1_DBIT1ERR_MASK                0x02000000
#define _CFD4BDIAG1_DBIT1ERR_LENGTH              0x00000001

#define _CFD4BDIAG1_DFORMERR_POSITION            0x0000001B
#define _CFD4BDIAG1_DFORMERR_MASK                0x08000000
#define _CFD4BDIAG1_DFORMERR_LENGTH              0x00000001

#define _CFD4BDIAG1_DSTUFERR_POSITION            0x0000001C
#define _CFD4BDIAG1_DSTUFERR_MASK                0x10000000
#define _CFD4BDIAG1_DSTUFERR_LENGTH              0x00000001

#define _CFD4BDIAG1_DCRCERR_POSITION             0x0000001D
#define _CFD4BDIAG1_DCRCERR_MASK                 0x20000000
#define _CFD4BDIAG1_DCRCERR_LENGTH               0x00000001

#define _CFD4BDIAG1_ESI_POSITION                 0x0000001E
#define _CFD4BDIAG1_ESI_MASK                     0x40000000
#define _CFD4BDIAG1_ESI_LENGTH                   0x00000001

#define _CFD4BDIAG1_DLCMM_POSITION               0x0000001F
#define _CFD4BDIAG1_DLCMM_MASK                   0x80000000
#define _CFD4BDIAG1_DLCMM_LENGTH                 0x00000001

#define _CFD4TEFCON_TEFNEIE_POSITION             0x00000000
#define _CFD4TEFCON_TEFNEIE_MASK                 0x00000001
#define _CFD4TEFCON_TEFNEIE_LENGTH               0x00000001

#define _CFD4TEFCON_TEFHIE_POSITION              0x00000001
#define _CFD4TEFCON_TEFHIE_MASK                  0x00000002
#define _CFD4TEFCON_TEFHIE_LENGTH                0x00000001

#define _CFD4TEFCON_TEFFIE_POSITION              0x00000002
#define _CFD4TEFCON_TEFFIE_MASK                  0x00000004
#define _CFD4TEFCON_TEFFIE_LENGTH                0x00000001

#define _CFD4TEFCON_TEFOVIE_POSITION             0x00000003
#define _CFD4TEFCON_TEFOVIE_MASK                 0x00000008
#define _CFD4TEFCON_TEFOVIE_LENGTH               0x00000001

#define _CFD4TEFCON_TEFTSEN_POSITION             0x00000005
#define _CFD4TEFCON_TEFTSEN_MASK                 0x00000020
#define _CFD4TEFCON_TEFTSEN_LENGTH               0x00000001

#define _CFD4TEFCON_UINC_POSITION                0x00000008
#define _CFD4TEFCON_UINC_MASK                    0x00000100
#define _CFD4TEFCON_UINC_LENGTH                  0x00000001

#define _CFD4TEFCON_FRESET_POSITION              0x0000000A
#define _CFD4TEFCON_FRESET_MASK                  0x00000400
#define _CFD4TEFCON_FRESET_LENGTH                0x00000001

#define _CFD4TEFCON_FSIZE_POSITION               0x00000018
#define _CFD4TEFCON_FSIZE_MASK                   0x1F000000
#define _CFD4TEFCON_FSIZE_LENGTH                 0x00000005

#define _CFD4TEFSTA_TEFNEIF_POSITION             0x00000000
#define _CFD4TEFSTA_TEFNEIF_MASK                 0x00000001
#define _CFD4TEFSTA_TEFNEIF_LENGTH               0x00000001

#define _CFD4TEFSTA_TEFHIF_POSITION              0x00000001
#define _CFD4TEFSTA_TEFHIF_MASK                  0x00000002
#define _CFD4TEFSTA_TEFHIF_LENGTH                0x00000001

#define _CFD4TEFSTA_TEFFIF_POSITION              0x00000002
#define _CFD4TEFSTA_TEFFIF_MASK                  0x00000004
#define _CFD4TEFSTA_TEFFIF_LENGTH                0x00000001

#define _CFD4TEFSTA_TEFOVIF_POSITION             0x00000003
#define _CFD4TEFSTA_TEFOVIF_MASK                 0x00000008
#define _CFD4TEFSTA_TEFOVIF_LENGTH               0x00000001

#define _CFD4TEFUA_TEFUA_POSITION                0x00000000
#define _CFD4TEFUA_TEFUA_MASK                    0xFFFFFFFF
#define _CFD4TEFUA_TEFUA_LENGTH                  0x00000020

#define _CFD4FIFOBA_FIFOBA_POSITION              0x00000000
#define _CFD4FIFOBA_FIFOBA_MASK                  0xFFFFFFFF
#define _CFD4FIFOBA_FIFOBA_LENGTH                0x00000020

#define _CFD4TXQCON_TXQNIE_POSITION              0x00000000
#define _CFD4TXQCON_TXQNIE_MASK                  0x00000001
#define _CFD4TXQCON_TXQNIE_LENGTH                0x00000001

#define _CFD4TXQCON_TXQEIE_POSITION              0x00000002
#define _CFD4TXQCON_TXQEIE_MASK                  0x00000004
#define _CFD4TXQCON_TXQEIE_LENGTH                0x00000001

#define _CFD4TXQCON_TXATIE_POSITION              0x00000004
#define _CFD4TXQCON_TXATIE_MASK                  0x00000010
#define _CFD4TXQCON_TXATIE_LENGTH                0x00000001

