Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
#define _CFD4FIFOCON20_RTREN_POSITION            0x00000006
#define _CFD4FIFOCON20_RTREN_MASK                0x00000040
#define _CFD4FIFOCON20_RTREN_LENGTH              0x00000001

#define _CFD4FIFOCON20_TXEN_POSITION             0x00000007
#define _CFD4FIFOCON20_TXEN_MASK                 0x00000080
#define _CFD4FIFOCON20_TXEN_LENGTH               0x00000001

#define _CFD4FIFOCON20_UINC_POSITION             0x00000008
#define _CFD4FIFOCON20_UINC_MASK                 0x00000100
#define _CFD4FIFOCON20_UINC_LENGTH               0x00000001

#define _CFD4FIFOCON20_TXREQ_POSITION            0x00000009
#define _CFD4FIFOCON20_TXREQ_MASK                0x00000200
#define _CFD4FIFOCON20_TXREQ_LENGTH              0x00000001

#define _CFD4FIFOCON20_FRESET_POSITION           0x0000000A
#define _CFD4FIFOCON20_FRESET_MASK               0x00000400
#define _CFD4FIFOCON20_FRESET_LENGTH             0x00000001

#define _CFD4FIFOCON20_TXPRI_POSITION            0x00000010
#define _CFD4FIFOCON20_TXPRI_MASK                0x001F0000
#define _CFD4FIFOCON20_TXPRI_LENGTH              0x00000005

#define _CFD4FIFOCON20_TXAT_POSITION             0x00000015
#define _CFD4FIFOCON20_TXAT_MASK                 0x00600000
#define _CFD4FIFOCON20_TXAT_LENGTH               0x00000002

#define _CFD4FIFOCON20_FSIZE_POSITION            0x00000018
#define _CFD4FIFOCON20_FSIZE_MASK                0x1F000000
#define _CFD4FIFOCON20_FSIZE_LENGTH              0x00000005

#define _CFD4FIFOCON20_PLSIZE_POSITION           0x0000001D
#define _CFD4FIFOCON20_PLSIZE_MASK               0xE0000000
#define _CFD4FIFOCON20_PLSIZE_LENGTH             0x00000003

#define _CFD4FIFOSTA20_TFNRFNIF_POSITION         0x00000000
#define _CFD4FIFOSTA20_TFNRFNIF_MASK             0x00000001
#define _CFD4FIFOSTA20_TFNRFNIF_LENGTH           0x00000001

#define _CFD4FIFOSTA20_TFHRFHIF_POSITION         0x00000001
#define _CFD4FIFOSTA20_TFHRFHIF_MASK             0x00000002
#define _CFD4FIFOSTA20_TFHRFHIF_LENGTH           0x00000001

#define _CFD4FIFOSTA20_TFERFFIF_POSITION         0x00000002
#define _CFD4FIFOSTA20_TFERFFIF_MASK             0x00000004
#define _CFD4FIFOSTA20_TFERFFIF_LENGTH           0x00000001

#define _CFD4FIFOSTA20_RXOVIF_POSITION           0x00000003
#define _CFD4FIFOSTA20_RXOVIF_MASK               0x00000008
#define _CFD4FIFOSTA20_RXOVIF_LENGTH             0x00000001

#define _CFD4FIFOSTA20_TXATIF_POSITION           0x00000004
#define _CFD4FIFOSTA20_TXATIF_MASK               0x00000010
#define _CFD4FIFOSTA20_TXATIF_LENGTH             0x00000001

#define _CFD4FIFOSTA20_TXERR_POSITION            0x00000005
#define _CFD4FIFOSTA20_TXERR_MASK                0x00000020
#define _CFD4FIFOSTA20_TXERR_LENGTH              0x00000001

#define _CFD4FIFOSTA20_TXLARB_POSITION           0x00000006
#define _CFD4FIFOSTA20_TXLARB_MASK               0x00000040
#define _CFD4FIFOSTA20_TXLARB_LENGTH             0x00000001

#define _CFD4FIFOSTA20_TXABT_POSITION            0x00000007
#define _CFD4FIFOSTA20_TXABT_MASK                0x00000080
#define _CFD4FIFOSTA20_TXABT_LENGTH              0x00000001

#define _CFD4FIFOSTA20_FIFOCI_POSITION           0x00000008
#define _CFD4FIFOSTA20_FIFOCI_MASK               0x00001F00
#define _CFD4FIFOSTA20_FIFOCI_LENGTH             0x00000005

#define _CFD4FIFOUA20_FIFOUA_POSITION            0x00000000
#define _CFD4FIFOUA20_FIFOUA_MASK                0xFFFFFFFF
#define _CFD4FIFOUA20_FIFOUA_LENGTH              0x00000020

#define _CFD4FIFOCON21_TFNRFNIE_POSITION         0x00000000
#define _CFD4FIFOCON21_TFNRFNIE_MASK             0x00000001
#define _CFD4FIFOCON21_TFNRFNIE_LENGTH           0x00000001

#define _CFD4FIFOCON21_TFHRFHIE_POSITION         0x00000001
#define _CFD4FIFOCON21_TFHRFHIE_MASK             0x00000002
#define _CFD4FIFOCON21_TFHRFHIE_LENGTH           0x00000001

#define _CFD4FIFOCON21_TFERFFIE_POSITION         0x00000002
#define _CFD4FIFOCON21_TFERFFIE_MASK             0x00000004
#define _CFD4FIFOCON21_TFERFFIE_LENGTH           0x00000001

#define _CFD4FIFOCON21_RXOVIE_POSITION           0x00000003
#define _CFD4FIFOCON21_RXOVIE_MASK               0x00000008
#define _CFD4FIFOCON21_RXOVIE_LENGTH             0x00000001

#define _CFD4FIFOCON21_TXATIE_POSITION           0x00000004
#define _CFD4FIFOCON21_TXATIE_MASK               0x00000010
#define _CFD4FIFOCON21_TXATIE_LENGTH             0x00000001

#define _CFD4FIFOCON21_RXTSEN_POSITION           0x00000005
#define _CFD4FIFOCON21_RXTSEN_MASK               0x00000020
#define _CFD4FIFOCON21_RXTSEN_LENGTH             0x00000001

#define _CFD4FIFOCON21_RTREN_POSITION            0x00000006
#define _CFD4FIFOCON21_RTREN_MASK                0x00000040
#define _CFD4FIFOCON21_RTREN_LENGTH              0x00000001

#define _CFD4FIFOCON21_TXEN_POSITION             0x00000007
#define _CFD4FIFOCON21_TXEN_MASK                 0x00000080
#define _CFD4FIFOCON21_TXEN_LENGTH               0x00000001

#define _CFD4FIFOCON21_UINC_POSITION             0x00000008
#define _CFD4FIFOCON21_UINC_MASK                 0x00000100
#define _CFD4FIFOCON21_UINC_LENGTH               0x00000001

#define _CFD4FIFOCON21_TXREQ_POSITION            0x00000009
#define _CFD4FIFOCON21_TXREQ_MASK                0x00000200
#define _CFD4FIFOCON21_TXREQ_LENGTH              0x00000001

#define _CFD4FIFOCON21_FRESET_POSITION           0x0000000A
#define _CFD4FIFOCON21_FRESET_MASK               0x00000400
#define _CFD4FIFOCON21_FRESET_LENGTH             0x00000001

#define _CFD4FIFOCON21_TXPRI_POSITION            0x00000010
#define _CFD4FIFOCON21_TXPRI_MASK                0x001F0000
#define _CFD4FIFOCON21_TXPRI_LENGTH              0x00000005

#define _CFD4FIFOCON21_TXAT_POSITION             0x00000015
#define _CFD4FIFOCON21_TXAT_MASK                 0x00600000
#define _CFD4FIFOCON21_TXAT_LENGTH               0x00000002

#define _CFD4FIFOCON21_FSIZE_POSITION            0x00000018
#define _CFD4FIFOCON21_FSIZE_MASK                0x1F000000
#define _CFD4FIFOCON21_FSIZE_LENGTH              0x00000005

#define _CFD4FIFOCON21_PLSIZE_POSITION           0x0000001D
#define _CFD4FIFOCON21_PLSIZE_MASK               0xE0000000
#define _CFD4FIFOCON21_PLSIZE_LENGTH             0x00000003

