Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl064.h
/* Default Memory-region macros */
#define __BOOT2LASTPAGE_BASE                     0xBFC64000
#define __BOOT2LASTPAGE_LENGTH                   0x1000
#define __KSEG1_BOOT_MEM_BASE                    0xBFC00000
#define __KSEG1_BOOT_MEM_LENGTH                  0x480
#define __KSEG1_BOOT_MEM_4B0_BASE                0xBFC004B0
#define __KSEG1_BOOT_MEM_4B0_LENGTH              0x3A80
#define __BOOT1LASTPAGE_BASE                     0xBFC44000
#define __BOOT1LASTPAGE_LENGTH                   0x1000
#define __UPPERBOOTALIASLASTPAGE_BASE            0xBFC24000
#define __UPPERBOOTALIASLASTPAGE_LENGTH          0x1000
#define __BOOT1_BASE                             0xBFC40000
#define __BOOT1_LENGTH                           0x3F30
#define __BOOT2_BASE                             0xBFC60000
#define __BOOT2_LENGTH                           0x3F30
#define __LOWERBOOTALIASLASTPAGE_BASE            0xBFC04000
#define __LOWERBOOTALIASLASTPAGE_LENGTH          0x1000
#define __UPPERBOOTALIAS_BASE                    0xBFC20000
#define __UPPERBOOTALIAS_LENGTH                  0x3F30
#define __DEBUG_EXEC_MEM_BASE                    0x9FC20490
#define __DEBUG_EXEC_MEM_LENGTH                  0x3AA0
#define __KSEG0_PROGRAM_MEM_BASE                 0x9D000000
#define __KSEG0_PROGRAM_MEM_LENGTH               0x80000
#define __KSEG0_DATA_MEM_BASE                    0x80000000
#define __KSEG0_DATA_MEM_LENGTH                  0x20000
#define __CONFIGSFRS_BFC03FB0_BASE               0xBFC03FB0
#define __CONFIGSFRS_BFC03FB0_LENGTH             0x20
#define __CONFIGSFRS_BFC45020_BASE               0xBFC45020
#define __CONFIGSFRS_BFC45020_LENGTH             0x10
#define __CONFIGSFRS_BFC43FB0_BASE               0xBFC43FB0
#define __CONFIGSFRS_BFC43FB0_LENGTH             0x20
#define __CONFIGSFRS_BFC43F30_BASE               0xBFC43F30
#define __CONFIGSFRS_BFC43F30_LENGTH             0x20
#define __CONFIGSFRS_BFC03F30_BASE               0xBFC03F30
#define __CONFIGSFRS_BFC03F30_LENGTH             0x20
#define __CONFIGSFRS_BFC23FB0_BASE               0xBFC23FB0
#define __CONFIGSFRS_BFC23FB0_LENGTH             0x20
#define __CONFIGSFRS_BFC45000_BASE               0xBFC45000
#define __CONFIGSFRS_BFC45000_LENGTH             0x1C
#define __CONFIGSFRS_BFC63FB0_BASE               0xBFC63FB0
#define __CONFIGSFRS_BFC63FB0_LENGTH             0x20
#define __CONFIGSFRS_BFC23F30_BASE               0xBFC23F30
#define __CONFIGSFRS_BFC23F30_LENGTH             0x20
#define __CONFIGSFRS_BFC63F30_BASE               0xBFC63F30
#define __CONFIGSFRS_BFC63F30_LENGTH             0x20
#define __CONFIGSFRS_BFC45030_BASE               0xBFC45030
#define __CONFIGSFRS_BFC45030_LENGTH             0x10
#define __SFRS_BASE                              0xBF800000
#define __SFRS_LENGTH                            0x100000

/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MK0512GPL064
#  define __32MK0512GPL064 1
#endif
#ifndef __32MK0512GPL064__
#  define __32MK0512GPL064__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 512
#endif
#ifndef __PIC32MK
#  define __PIC32MK 1
#endif
#ifndef __PIC32MK__
#  define __PIC32MK__ 1
#endif
/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_MIPS32R2
# define __PIC32_HAS_MIPS32R2 1
#endif
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_DSPR2
# define __PIC32_HAS_DSPR2 1
#endif
#ifndef __PIC32_HAS_FPU64
# define __PIC32_HAS_FPU64 1
#endif
#ifndef __PIC32_HAS_SSX
# define __PIC32_HAS_SSX 1
#endif
#ifndef __PIC32_HAS_INIT_DATA
# define __PIC32_HAS_INIT_DATA 1
#endif
#ifndef __PIC32_SRS_SET_COUNT
# define __PIC32_SRS_SET_COUNT 2
#endif

#endif
